#!/usr/bin/python3
'''
Исправление дубликатов 🌶️
На вход программе подается строка, содержащая строки-идентификаторы. Напишите программу, которая исправляет их так, чтобы в результирующей строке не было дубликатов. Для этого необходимо прибавлять к повторяющимся идентификаторам постфикс _n, где n – количество раз, сколько такой идентификатор уже встречался.
Формат входных данных
На вход программе подается строка текста, содержащая строки-идентификаторы, разделенные символом пробела.
Формат выходных данных
Программа должна вывести исправленную строку, не содержащую дубликатов сохранив при этом исходный порядок.
'''

s = input().split()
my_dict = {}
my_list = []

for i in s:
    if i not in my_list:
        my_list.append(i)
    else:
        my_dict[i] = my_dict.get(i, 0) + 1
        my_list.append(i + '_' + str(my_dict[i]))
        
print(*my_list)

